//===================================================
//
// マルチレンダーターゲットの種類 [mrt_type.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MRT_TYPE_HPP_
#define _MRT_TYPE_HPP_

//***************************************************
// インクルードファイル
//***************************************************
namespace MRTType
{
	enum TYPE
	{
		TYPE_TUTORIAL = 0,			// チュートリアル
		TYPE_TITLE,					// タイトル
		TYPE_TIMER,					// タイマー
		TYPE_RESULT,				// リザルト
		TYPE_RANKING,				// ランキング
		TYPE_MAX
	};
}
#endif