//===================================================
//
// マルチレンダーターゲットのIDのコンポーネント [mrt_target_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _MRT_TARGET_COMPONENT_HPP_
#define _MRT_TARGET_COMPONENT_HPP_

//***************************************************
// インクルードファイル
//***************************************************
#include "mrt_type.hpp"

//***************************************************
// マルチレンダーターゲットのIDのデータの定義
//***************************************************
struct MRTTargetComponent
{
	MRTTargetComponent(const MRTType::TYPE _target) : 
		target(_target)
	{}

	MRTType::TYPE target; // ターゲット
};
#endif