//===================================================
//
// マルチレンダーターゲットのテクスチャのキーのデータ [renderer_mt_key_component.hpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _RENDERER_MT_KEY_COMPONENT_HPP_
#define _RENDERER_MT_KEY_COMPONENT_HPP_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// マルチレンダーターゲットのテクスチャのキーのデータの定義
//***************************************************
struct RendererMTKeyComponent
{
	RendererMTKeyComponent(const int _nType) : 
		nType(_nType)
	{}

	int nType; // キー
};
#endif